Tekla Open API Reference for Tekla Structures 2025
LevelMark.LevelMarkType Enumeration
 Defines options about how the level mark is shown.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LevelMarkType
Public Enumeration LevelMarkType
Members
Member name | Value | Description
NoArrowNoLeaderLine | 0 |  Level mark is shown without an arrow and a leader line.
ArrowWithoutLeaderLine | 1 |  Level mark is shown with an arrow but without a leader line.
InclinedLeaderLine | 2 |  Level mark is shown with an inclined leader line but without an arrow.
OrthogonalLeaderLine | 3 |  Level mark is shown with an orthogonal leader line and with an arrow.
See Also
Reference
Tekla.Structures.Drawing Namespace